cavity/plateExt_lowVis/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       52390;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       52470;
    }
    zeroGradientPlanes
    {
        type            wall;
        inGroups        1(wall);
        nFaces          440;
        startFace       52770;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          52800;
        startFace       53210;
    }
)

// ************************************************************************* //
