cavity/plateExt_lowVis/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)		//0
    (1 0 0)		//01
    (1 1 0)		//02
    (0 1 0)		//03
    (0 0 0.1)		//04
    (1 0 0.1)		//05
    (1 1 0.1)		//06
    (0 1 0.1)		//07
    (6 0 0)		//08
    (6 1 0)		//09
    (6 0 0.1)		//10
    (6 1 0.1)		//11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 80 1) simpleGrading (0.2 40 1)
    hex (1 8 9 2 5 10 11 6) (300 80 1) simpleGrading (5 40 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    plate
    {
        type wall;
        faces
        (
            (1 8 10 5)
        );
    }

    zeroGradientPlanes
    {
        type wall;
        faces
        (
            (1  5 4 0)
	    (8 9 11 10)
	    (3 7 6 2)
	    (2 6 11 9)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
	    (1 2 9 8)
	    (5 10 11 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
